splunk URL
**********

       Learning and Certification>
         Reg: Fund-2 -> 455-37024-360536-260-976765 
         https://education.splunk.com/user/learning/enrollments
	 https://inter.viewcentral.com/reg/splunk/login 
	 http://education.splunk.com/HowToEnroll

       Splunk Storage Sizing>
       	 https://splunk-sizing.appspot.com/
	 
       Cheat Sheet>
         https://lzone.de/cheat-sheet/Splunk
     
     

	Base app>
	  Dashboard examples -> https://splunkbase.splunk.com/app/1603/

	known issues
	  THP Disable -> https://docs.splunk.com/Documentation/Splunk/latest/ReleaseNotes/SplunkandTHP

	memory overcommiting
	  https://docs.splunk.com/Documentation/Splunk/7.2.3/ReleaseNotes/LinuxmemoryovercommittingandSplunkcrashes

	install splunk on windows through cli
	  https://docs.splunk.com/Documentation/Splunk/latest/Installation/InstallonWindowsviathecommandline

	Secure Splunk Web with your own certificate
	  https://docs.splunk.com/Documentation/Splunk/latest/Security/SecureSplunkWebusingasignedcertificate

	Components and the data pipeline
	  https://docs.splunk.com/Documentation/Splunk/latest/Deploy/Componentsofadistributedenvironment

	Other manuals for the Splunk platform administrator
	  https://docs.splunk.com/Documentation/Splunk/latest/Admin/Whatsinthismanual

	Archive indexed data
	  https://docs.splunk.com/Documentation/Splunk/latest/Indexer/Automatearchiving

	Restore archived indexed data
	  https://docs.splunk.com/Documentation/Splunk/latest/Indexer/Restorearchiveddata

	indexes.conf.spec
	  https://docs.splunk.com/Documentation/Splunk/latest/admin/Indexesconf#indexes.conf.spec

	Authentication methods
	  https://docs.splunk.com/Documentation/Splunk/latest/Security/Hardeningstandards 

	Plan a deployment
	  https://docs.splunk.com/Documentation/Splunk/6.2.1/Updating/Planadeployment

	Deploy a heavy forwarder
	  https://docs.splunk.com/Documentation/Splunk/latest/Forwarding/Deployaheavyforwarder

	About securing data from forwarders
	  https://docs.splunk.com/Documentation/Splunk/latest/Security/Aboutsecuringdatafromforwarders

	About the Monitoring Console
	  https://docs.splunk.com/Documentation/Splunk/latest/DMC/DMCoverview
  

  


splunk queries
***************
	> write a search to pull the OS distribution of all hosts
	   index=_internal fwdType="*" | dedup hostname | stats count by os, version

	> To check the process states
	   index=os sourcetype=ps rhnsd|dedup host|stats count as runningCount|eval rhnsdMissing=(10-runningCount)| table rhnsdMissing

	> Combine three different source types(CPU,Memory, Network Utilization as perecentage) 
	  index=xyz (sourcetype=CPUtime OR sourcetype=Memory OR sourcetype=Localnetwork)  (counter="% Processor Time" OR counter="Committed Bytes" OR counter="Bytes Received/Sec") | chart  avg(Value) as values over host by counter

	> create and trigger an alert if the CPU usage is constantly 100% for the past 10 minutes
	  index=* host=zzzz sourcetype="Perfmon:CPU" source="Perfmon:CPU" counter="% Processor Time" | timechart span=10m limit=0 avg(Value) as "% of CPU Usage"

	> 



splunk forwarder
****************
	 >> Enable the splunk service during boot:
	   /opt/splunkforwarder/bin/splunk enable boot-start
	 >> Splunk add forwarder through CLI
	   /opt/splunkforwarder/bin/splunk add forward_server 10.x.x.x:9997
	 >> Add monitor of the log file
	   /opt/splunkforwarder/bin/splunk add monitor /opt/log/www1
	 >> 
 
 hardware errors key words
 *************************
 
	 "hardware error" AND 
 
Splunk tutorial
***************
	
Module - 9
***********

	 > top
	   index=sales sourcetype=vendor_sales 
	   | top vendor

	   | top vendor limit=10

	   | top vendor product_name limit=0

		   clauses used in top
		   limit=int
		   countfield=string
		   percentfield=string
		   showcount=True/False
		   showperc=True/False
		   showother=True/False
		   otherstr=string

	   | top vendor limit=5 showperc=False countfield="Number of Sales" useother=True

	     //useother - vendor not listed in top 5

	     // by clause
	     / top product_name by vendor limit=3 countfield="Number of Sales" showperc=False
   

	> rare same options like top command

	> stats 
	  stats functions(count,distinct count, sum, average, list, values)

	  index=sales sourcetype=vendor_sales
	  | stats count

	  | stats count as "Total Sells By Vendors"

	  | stats count as "Total Sells By Vendors" by product_name

	  | stats count as "Total Sells By Vendors" by product_name,categoryid,sale_price

	  //passing field to the count

	  index=web sourcetype=access_combined
	  | stats count(action) as ActionEvents

	  //Adding another count
	  index=web sourcetype=access_combined
	  | stats count(action) as ActionEvents,count as "Total Events"

	  //Distict count(dc) or dc interchangable
	  index=sales sourcetype=vendor_sales
	  | stats distinct_count(product_name) as "Number of games for sale by vendors" by sale_price


	  //sum usage
	  index=sales sourcetype=vendor_sales
	  | stats sum(price) as "Gross Sales" by product_name

	  | stats count as "Units Sold" sum(price) as "Gross Sales" by product_name

	  //avg usage
	  index=sales sourcetype=vendor_sales
	  | stats avg(sale_price) as "Average Selling Price" by product_name
	  | stats count as "Units Sold" 
	    avg(price) as "Average Retail Price"
	    avg(sale_price) as "Avg Selling Price" by product_name

	  //List Usage
	  index=bcgassets sourcetype=asset_list
	  | stats list(Asset) as "company assets" by Employee

	  //value Usage - only returns unique value
	  index=network sourcetype=cisco_wsa_squid
	  | stats values(s_hostname) by cs_username
  
	lookup
	*******

		add additional fields and numbers

		 > Need to upload the file locally from the desktop
		 > | inputlookup http_status.csv

		 Define lookup
		 *************
		 Go to settings-> lookup
		 select lookup definitions

		 Use lookup search query
		 ***********************
		 index=web sourcetype=access_combined NOT status=200
		 | lookup http_status code as status,
		 OUTPUT code as "HTTP Code",
		 description as "HTTP Description"

		 > Do not want override we can use 'OUTPUTNEW' class
		 OUTPUTNEW code as "HTTP Code"

		 index=web sourcetype=access_combined NOT status=200
		 | lookup http_status code as status,
		 OUTPUTNEW code as "HTTP Code",
		 description as "HTTP Description"
		 | table host, "HTTP Code", "HTTP Description"

		 >>>Automatic lookup
		 setting -> lookup
 
 
>>Fundamentails (Part-2)
************************
   Buckets - Configurable maximum timespan, size
   ********
	   HOT - WRITABLE - Reaches max size, time span reached, indexer restarted
	   WARM - Hot bucket rooling to warm bucket.Closed,renameed, changed to read only (ex:db_youngesttimestamp_oldtimestamp)
           COLD - Warm bucket rolling to cold bucket after reaching max size and time span
				It stored in different locations which is less spped hard drive to cost optimize

	  > Prioroty of search options to get best search results
	         time
		 index
		 source
		 host
		 sourcetype
	 
  Visualization Intro
  ********************

	index=sales sourcetype=vendor_sales
	| stats count(inline) as "UnitsSold" by product_name
	
	index=sales sourcetype=vendor_sales	
	| timechart count(inline) as "Units Sold" by product_name limit=5
	
	Chart
	*****
	  over, by class
	  index=web sourcetype=access_combined status>299
	  | chart count over status by host
	  
	  > Two options can be used under x-axis unlike stats command
	    index=web sourcetype=access_combined status>299
	    | chart count by status,host
		
	   > index=web sourcetype=access_combined status>299
	    | chart count over host by product_name usenull=f useother=f limit=5
		  
	 Timechart
         *********
	    >index=sales sourcetype=vendor_sales
	     | timechart count 
		
	     >index=sales sourcetype=vendor_sales
	     | timechart count by product_name
		
	      stats function can be applicable to timechart command - sum(price), avg(price)
		
		>index=sales sourcetype=vendor_sales
		| timechart sum(price) by product_name [we can user limit, usenull,useother]
		
		>index=sales sourcetype=vendor_sales
		| timechart span=12hr sum(price) by product_name

	  Scatter chart - shows the relation between two distinct values
	  *************
		Ex: index=sales sourcetype=vendor_sales VendorID>=4000 AND VendorID<=8999
		    | stats count as "Units Sold", sum(sale_price) as "Total Sales" by VendorCountry,product_name

	  Bubble chart - we can view third dimension of data
	  ************
		 Ex: index=sales sourcetype=vendor_sales
		    |VendorID >=4000 AND VendorID <= 8999
		    |stats sum(sale_price) as "Total", count as "#Sold"
		    by date_hour | sort date_hour
		    |rename date_hour as "Time" | table "Time" "#Sold" "Total"

   Advanced visualization
   ***********************
	  iplocation - city
             	       country
		       Region, 
		       Latitude, 
		       Longitude

	     example: index=security sourcetype=linux_secure action=success src_ip!=10.*       
		      | iplocation src_ip


          Using Geostats command
          **********************
 	      Aggregates geographical data for use on a map visualization
	    
		    example: index=sales sourcetype=vendor_sales
			     | geostats latfield=VendorLatitude longfield=VendorLongitude count

			or count by product_name globallimit=10

	  Using geostats with iplocation
	  *******************************

		   index=sales sourcetype=linux_secure action=success src_ip!=10.*
		   | iplocation src_ip
		   | geostats latfield=lat longfield=lon count

          choropleth Maps
          ***************

		    Will need Keyhole Markup Language File(.kmz)
		    Splunk ships two files: >> geo_us_states.kmz
					    >> geo_countries.kmz

		   Ex: index=sales sourcetype=vendor_sales VendorID>=5000 AND VendorID<=5055 
			| stats count as Sales by VendorCountry
			| geom geo_countries featureField=VendorCountry

	  singlevalue visualization
	  **************************

		    index=web sourcetype=access_combined action=purchase 
			| stats sum(price) as total

	  trendline commmand
          ******************
		     index=web sourcetype=access_combined action=purchase status=200
			| timechart sum(price) as sales
			| trendline wma2(sales) as trend

		      2-> Two days average value took it out
		    Trendtype:sma -> sum moving average
			      ema -> exponential moving average
			      wma -> weighted moving average

		  chartoverlay will be useful when using trendline

field format
************

  customnize it in many ways using format option

	index=web sourcetype=access_combined file=*
	| chart sum(bytes) over host by file


Addtotals
**********

   index=web sourcetype=access_combined file=*
	| chart sum(bytes) over host by file
	| addtotals

       or | addtotals col=true label="Total" labelfield="host"

    fieldname="Total by host"


eval
*****

   supports - arithmetic, Concatenation, Boolean Operators supported

  ex: index=network sourcetype=cisco_wsa_squid 
	| stats sum(sc_bytes) as Bytes by usage
	| eval bandwidth =  Bytes/1024/102

     or  wrapping of calculation in round function
	| eval bandwidth = round(Bytes/1024/1024,2)
	| sort -bandwidth
	| rename bandwidth as "Bandwidth (MB)"
	| fields - Bytes
   
   eval mathematical functions
   ===========================
   index=web sourcetype=access_c* product_name=* action=purchase
	| stats sum(price) as total_list_price,	
	  sum(sale_price) as total_sale_price by product_name
	| eval discount= (total_list_price - total_sale_price/total_list_price)*100
	| sort - discount
	| eval discount = discount."%"
	
   eval convert values
   ===================
   index=web soucetype=access* product_name=* action=purchase
	| stats sum(price) as total_list_price,
	sum(sale_price) as total_sale_price by product_name
	|eval total_list_price = "$"+ tostring(total_list_price)

   fieldformat command (confusion)
   ===================
   
   Multiple eval commands
   ======================
   
   index=web sourcetype=access_combined price=*
	| stats values(price) as list_price,
	values(sale_price) as sale_price by product_name
	| eval current_discount = (((list_price-sale_price/list_price)*100)
	| eval new_discount = (current_discount - 5)
	| eval new_sale_price=list_price - (list_price * (new_discount/100))
	| eval price_change_revenue=(new_sale_price-sale_price)

   eval command if function
   ========================
   
    if (x,y,z)
      x-boolean expression
      y- if true it will evaluate
      z- if false it will evaluate
      y,z -  Must be in double quotes if not numerical

   ex: index=sales sourcetype=vendor_sales
	| eval SalesTerritory=
	if(VendorID<4000,"Northe America", "Rest of the World")
	| stats sum(price) as TotalRevenue by SalesTerritory

   eval command case function
   ==========================
   Allows you to take multiple boolean expressions and return the corresponding
   argument that is true

   ex: index=web sourcetype=access_combined
	| eval httpCategory=case(status>=200 AND status<300, "Success")

      We can add more booleans
     status>=300 AND status<400, "Redirect",
     status>=400 AND status<500, "Client Error",
     status>=500,"Server Error")

    using Eval with stats command
    ==============================
   index=web sourcetype=access_combined 
	| status count(eval(status<300)) as "Success",
	count(eval(status>=400 AND status<500)) as "Client Error",
	count(eval(status>500)) as "Server Error"

    where command
    ==============
    index=network sourcetype=cisco_wsa_squid
	| status count(eval(usage="Personal")) as Personal,
	count(eval(usage="Business")) as Business by username
	| where Personal>Business 
	| where username!="username"
	|sort -personal

    Fillnull command
    ================
    index=sales sourcetype=vendor_sales
	| chart sum(price) over product_name by VendorCountry
	| fillnull

     or using a value argument any string can be used
	fillnull value="nothing to see here"

Correlating events
********************

     Transaction Command
     ===================
	index=web sourcetype=access_combined
	| transaction clientip
        | table clientip,action,product_name
	
	index=web sourcetpe=access_combined
	|transaction clientip
	|timechart avg(duration)
 
     Transaction Command Definitions
     ===============================
      maxspan, maximum total time between earliest and latest events 
	maxpause, max total time between events
	startswith,  - terms, field values, evaluations
	endswith - terms, field values, evaluations

     Ex:
	index=web sourcetype=access_combined
	| transaction clientip
	startswith="addtocart" endswith="purchase"
	| table clientip,action,product_name

     Investigate with transactions
     =============================
	index=network sourcetype=cisco_esa REJECT
	| transaction mid dcid icid
	| search REJECT
	
     Examples:
     	index=web sourcetype=access_combined action=*
	| transaction JSESSIONID
	| table JSESSIONID, clientip, action
	
	index=web sourcetype=access_combined action=*
	| transaction JSESSIONID
	| table JSESSIONID, clientip, action
	| search action=purchase
	
	index=web sourcetype=access_combined action=*
	|  transaction JSESSIONID 
	| table JSESSIONID, clientip,duration,eventcount,action 
	| search action=purchase 
	| eval durationMinutes=round(duration/60,1) 
	|  where durationMinutes>1
	
	index=web sourcetype=access_combined
	| transaction clientip startswith=action="addtocart" endswith=action="purchase"
	| table clientip, JSESSIONID, product_name, action, duration, eventcount, price
	
	(index=network sourcetype=cisco_wsa_squid) OR
	(index=web sourcetype=access_combined) status>399
	| fields sourcetype, status
	| transaction status maxspan=5m
	| search sourcetype=access_combined AND sourcetype=cisco_wsa_squid
	| timechart count by status
	
	(index=network sourcetype=cisco_wsa_squid) OR (index=web sourcetype=access_combined)
	status>399
	| fields sourcetype, status
	| transaction status maxspan=5m
	| search sourcetype=access_combined AND sourcetype=cisco_wsa_squid 
	| timechart count by status 
	| addtotals 
	| search Total>4 
	| fields - Total
	
Naming Convention
*****************
 Six segmented field
	Group
	Type
	Platform
	Category
	Time
	Description
	
 As we are working for security-focused workflow action	
   Ex:OPS_WFA_Network_Security_na_IPwhoisAction
      Group- OPS
      Type- WFA (work flow action)
      Platform - Network
      Category - Security
      Not time nased used -NA
      IPwhoisAction - Description
      
 Give delegates to others
    Under setting in splunk -> All Configurations
      Right edge corner -> Reassign knowledge objects
      
 Splnk uses "CIM" (Common Information Model) normalizing objects


  knowledge object permissions
	> Private - Only that user
	> Specific App - Power user, Admin can grant read and write perissions
	> All Apps - admin can only one grant ead and write
	
Field extraction
******************

     Two types: 1 Regular expression
	2. delimiter which separated with comma
	
     Regular expression - Unstructured data and events that you want to extract field from
     Delimiters - Used when events contain fields separated by a character

     Extract with GUI three methods
     Extract with tools:

Field Aliases (Aliases and Calc Fields)
****************************************

	Sourcetype may have different field names for unique field

	ex: one sourcetype can have "username" as field
	    another sourcetype can have "user" as field

	Navigate to settings -> Fields
	  Destination App: search
	  Name: EmployeeUsers
	  Apply to: sourcetype
	  Field aliases: Username: Employee
	  
	Note: same way need to add one more field which having same unique field of sourcetype
	
     Examples:
     	Go to Settings > Fields > Field aliases. Create a field alias with the following values:
	— Destination app: search
	— Name: cisco_wsa_squid_aliases
	— Apply to: sourcetype
	— Named: cisco_wsa_squid
	— Field aliases: cs_username = user
	Return to the Search & Reporting app. Re-run your search and examine the user field and values
	
	Go to Settings > Fields > Calculated fields.
	Create a calculated field named sc_megabytes that converts the value of sc_bytes to MB with the
	following values:
	— Destination app: search
	— Apply to: sourcetype
	— Named: cisco_wsa_squid
	— Name: sc_megabytes
	— Eval expression: sc_bytes/(1024*1024)

Tags and Event types
*********************

	 Tag -> click event option -> Action option and tag the name of the field
	   after placing tags search by
	   index=security tag=SF
	   
	 Event type from Search
	 **********************
	  > After search -> Save as Event type
	    Name - purchase_strategy
	    Tags - purchase_strategy,sales
	    color- blue
	    priority - highest 
	    
	    RUnning a search with event type
	    index=web sourcetype=access_combined
	    | eventtype=purchase_strategy
	    
	  Event type builder
	  ******************
	  Event type can also obtain from event type builder
	  
	  index=web sourcetype=access_combined action=purchase categoryId*
	  
	  From information(i) event id we select Event Actions -> Build Event Type
	   
	 > select build event type

	   Which search would limit an "alert" tag to the "host" field?
		tag::host=alert

	   These allow you to categorize events based on search terms.
		Event Types

	   Tags are descriptive names for -> key value pairs
    
Macros
******

	  Reusable search strings or portions of search strings
	  Useful for frequest searches with complicated search syntax
	  store entire search strings
	  Time range independent
	   pass arguments to the search
  
	  create macro
	  =============

	  Ex: index=sales sourcetype=vendor_sales
		| stats sum(sale_price) as total_sales by Vendor
		|eval total_sales = "$" + tostring(round(total_sales,2), "commas")

	   settings -> advanced search -> add new macro
	   place it over there in Definition -> eval total_sales = "$" + tostring(round(total_sales,2), "commas")

	   index=sales sourcetype=vendor_sales
	   | stats sum(sale_price) as total_sales by Vendor
	   |'convertUSD'
		
	   Note: Using backtik character will indicate to the splunk it is macro definition

	   Macro argument
	   ==============

	   Multiple arguments can use during different search options
	   Setting-> Advanced search-> create macro
	   Name - convertUSD(1)
	   eval $moolah$ = "$" + tostring(round($moolah$,2),"commas")
	   Argument field -> moolah
	   
           Example:
	     index=sales sourcetype=vendor_sales
	     | stats sum(sale_price) as total_sales by Vendor
	     |'convertUSD(total_sales)'
	     
	  > Expanded search -> Ctl+Shift+E
	  
Workflow actions
*****************
      Create links to interact with external resources or narrow research
      
    Create GET  
      Navigate to settings -> Fields -> Click Work flow action
      
        Destination app-> search
	Name  -> OPS_WFA_Network_Security_ns_GetWhoIs
	Label -> Get Whois for $src_ip$
	Apply only to the following fields -> src_ip
	Apply only to the following event types -> <if balnk> Indicate applicable to all
	Show action in -> Both (Event and field)
	Action type -> link
	
	URI -> http://whois.domaintools.com/$src_ip$
	Open link in -> New window or Same Window
	Link method -> get
	
       To test our work flow action
         index=security sourcetype=linux_secure failed root src_ip>11
	 
     Create POST
        Navigate to settings -> Fields -> Click Work flow action
	Name  -> OPS_WFA_Network_Security_na_TicketPost
	Label -> Create ticket
	Apply only to the following field -> status
	Show action in -> Event menu
	Action type -> link
      
        Link configuration
	  URI -> http://52.3.246.206
	  Open link in -> New window
	  Link method -> post
	 
	  Post arguments -> summary = $status$error$host$
	  		    priority = urgetn
			    occurred=$_time$
			    environment=$host$
			    details=$_raw$
			   
	 Create search
	 	
